src/AccumulationRegisters/ДенежныеСредстваНаЛицевыхСчетах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваНаЛицевыхСчетах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/InformationRegisters/РодственныеСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РодственныеСвязи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтепеньРодства</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ЗаконныйПредставитель</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийБонусныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщийНакопительныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитыДокументаЗаконногоПредставителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Родственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/СтруктурныеЕдиницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>СтруктурныеЕдиницы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидЦенРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОкончанияРаботы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаКлиентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Долгота</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЯндексКарты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиЯндексКарты</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСклад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СервисSMSРассылки</Name>
					<Comment>Сервис SMS-Рассылки</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СервисыРассылки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УникальныйИдентификаторСтруктурнойЕдиницы</Name>
					<Comment>Необходим для онлайн-записи для выгрузки в reservi</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Широта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РасписаниеРаботы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДеньНедели</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НачалоРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОкончаниеРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Time</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодаСтраны</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаПоследниеЦифры</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/AccumulationRegisters/ДенежныеСредстваНаЛицевыхСчетах/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции
 
 // Функция вернет остатко на ЛС клиента
 //
 Функция ПолучитьОстаткиНаЛицевыхСчетахКонтрагента(Контрагент
	                                              ,Период = Неопределено
	                                              ,НеУчитыватьРегистратор = Неопределено
												  ,СтруктурнаяЕдиница = Неопределено
												  ,ВидСчета = Неопределено
												  ,ВозвратТолькоСуммы = Ложь
												  ,ВключатьВсеСчетаРодственников = Ложь) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВидыЛицевыхСчетов.Ссылка КАК ВидСчета,
	|	ЕСТЬNULL(ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент, &Клиент) КАК Контрагент,
	|	СУММА(ЕСТЬNULL(ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот, 0)) КАК СуммаОстаток
	|ИЗ
	|	Справочник.ВидыЛицевыхСчетов КАК ВидыЛицевыхСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета КАК ВидСчета,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент КАК Контрагент,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот КАК СуммаОборот
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Обороты(
	|					,
	|					&Период,
	|					Регистратор,
	|					(Контрагент = &Клиент
	|						ИЛИ &ВключатьВсеСчетаРодственников = ИСТИНА
	|							И Контрагент В
	|								(ВЫБРАТЬ
	|									РегистрСведений.РодственныеСвязи.Родственник
	|								ИЗ
	|									РегистрСведений.РодственныеСвязи
	|								ГДЕ
	|									РегистрСведений.РодственныеСвязи.Контрагент = &Клиент
	|									И РегистрСведений.РодственныеСвязи.ОбщийЛицевойСчет = ИСТИНА))
	|						И ВЫБОР
	|							КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|									И &СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|								ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ВидСчета = &ВидСчета
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ГДЕ
	|			НЕ ДенежныеСредстваНаЛицевыхСчетахОбороты.Регистратор В (&Регистратор)) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ПО (ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета = ВидыЛицевыхСчетов.Ссылка)
	|ГДЕ
	|	ВидыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВидыЛицевыхСчетов.Ссылка = &ВидСчета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыЛицевыхСчетов.Ссылка,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидСчета,
	|	Контрагент";						  
	
	МассивИсключаемыхДок = Новый Массив;
	Если ЗначениеЗаполнено(НеУчитыватьРегистратор) Тогда
		Если ТипЗнч(НеУчитыватьРегистратор) = Тип("Массив") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор;
		ИначеЕсли ТипЗнч(НеУчитыватьРегистратор) = Тип("СписокЗначений") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор.ВыгрузитьЗначения();
		Иначе
			 МассивИсключаемыхДок.Добавить(НеУчитыватьРегистратор);
		КонецЕсли;   	
	КонецЕсли;	
	
	Запрос.УстановитьПараметр("Период"              		 , ?(Период = Неопределено,Дата(0001,01,01,0,0,0),Период));
	Запрос.УстановитьПараметр("Регистратор"         		 , МассивИсключаемыхДок);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"  		 , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Клиент"              		 , Контрагент);
	Запрос.УстановитьПараметр("ВключатьВсеСчетаРодственников", ВключатьВсеСчетаРодственников);
	Запрос.УстановитьПараметр("ВидСчета"            		 , ВидСчета);
	
	Выборка = Запрос.Выполнить().Выгрузить();
	
	Если Выборка.Количество() >0 Тогда
		Возврат ?(ВозвратТолькоСуммы,Выборка.Итог("СуммаОстаток"),Выборка);
	Иначе 
		Возврат 0;
	КонецЕсли;	
	
КонецФункции

// Функция вернет остатки на лицевых счетах контрагента в разрезе структурных единиц
Функция ПолучитьОстаткиНаЛицевымСчетахКонтрагентаПоСЕ(Контрагент
	                                                 ,Период = Неопределено
	                                                 ,НеУчитыватьРегистратор = Неопределено
												     ,СтруктурнаяЕдиница = Неопределено
												     ,ВидСчета = Неопределено
												     ,ВозвратТолькоСуммы = Ложь
												     ,ВключатьВсеСчетаРодственников = Ложь) Экспорт
	
	Запрос       = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ВидыЛицевыхСчетов.Ссылка КАК ВидСчета,
	|	СУММА(ЕСТЬNULL(ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот, 0)) КАК СуммаОстаток
	|ИЗ
	|	Справочник.ВидыЛицевыхСчетов КАК ВидыЛицевыхСчетов
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета КАК ВидСчета,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент КАК Контрагент,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.СуммаОборот КАК СуммаОборот,
	|			ДенежныеСредстваНаЛицевыхСчетахОбороты.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|		ИЗ
	|			РегистрНакопления.ДенежныеСредстваНаЛицевыхСчетах.Обороты(
	|					,
	|					&Период,
	|					Регистратор,
	|					(Контрагент = &Клиент
	|						ИЛИ &ВключатьВсеСчетаРодственников = ИСТИНА
	|							И Контрагент В
	|								(ВЫБРАТЬ
	|									РегистрСведений.РодственныеСвязи.Родственник
	|								ИЗ
	|									РегистрСведений.РодственныеСвязи
	|								ГДЕ
	|									РегистрСведений.РодственныеСвязи.Контрагент = &Клиент
	|									И РегистрСведений.РодственныеСвязи.ОбщийЛицевойСчет = ИСТИНА))
	|						И ВЫБОР
	|							КОГДА &СтруктурнаяЕдиница <> НЕОПРЕДЕЛЕНО
	|									И &СтруктурнаяЕдиница <> ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
	|								ТОГДА СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ
	|						И ВЫБОР
	|							КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|								ТОГДА ВидСчета = &ВидСчета
	|							ИНАЧЕ ИСТИНА
	|						КОНЕЦ) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ГДЕ
	|			НЕ ДенежныеСредстваНаЛицевыхСчетахОбороты.Регистратор В (&Регистратор)) КАК ДенежныеСредстваНаЛицевыхСчетахОбороты
	|		ПО (ДенежныеСредстваНаЛицевыхСчетахОбороты.ВидСчета = ВидыЛицевыхСчетов.Ссылка)
	|ГДЕ
	|	ВидыЛицевыхСчетов.ПометкаУдаления = ЛОЖЬ
	|	И ВЫБОР
	|			КОГДА &ВидСчета <> НЕОПРЕДЕЛЕНО
	|				ТОГДА ВидыЛицевыхСчетов.Ссылка = &ВидСчета
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|
	|СГРУППИРОВАТЬ ПО
	|	ВидыЛицевыхСчетов.Ссылка,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.СтруктурнаяЕдиница
	|
	|УПОРЯДОЧИТЬ ПО
	|	СтруктурнаяЕдиница,
	|	ВидСчета,
	|	ДенежныеСредстваНаЛицевыхСчетахОбороты.Контрагент";						  
	
	МассивИсключаемыхДок = Новый Массив;
	Если ЗначениеЗаполнено(НеУчитыватьРегистратор) Тогда
		Если ТипЗнч(НеУчитыватьРегистратор) = Тип("Массив") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор;
		ИначеЕсли ТипЗнч(НеУчитыватьРегистратор) = Тип("СписокЗначений") Тогда
			МассивИсключаемыхДок = НеУчитыватьРегистратор.ВыгрузитьЗначения();
		Иначе
			 МассивИсключаемыхДок.Добавить(НеУчитыватьРегистратор);
		КонецЕсли;   	
	КонецЕсли;	

	Запрос.УстановитьПараметр("Период"              		 , ?(Период = Неопределено,Дата(0001,01,01,0,0,0),Период));
	Запрос.УстановитьПараметр("Регистратор"         		 , МассивИсключаемыхДок);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница"  		 , СтруктурнаяЕдиница);
	Запрос.УстановитьПараметр("Клиент"              		 , Контрагент);
	Запрос.УстановитьПараметр("ВключатьВсеСчетаРодственников", ВключатьВсеСчетаРодственников);
	Запрос.УстановитьПараметр("ВидСчета"            		 , ВидСчета);
	
	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

#КонецОбласти
